---
kind: type
id: T:Autodesk.Revit.DB.ModelCurve
source: html/f15a85c2-3aee-9055-f9f8-9001b47fcefb.htm
---
# Autodesk.Revit.DB.ModelCurve

A model element that exists in 3D space and is visible in all views of a Revit project.

## Syntax (C#)
```csharp
public class ModelCurve : CurveElement
```